app/controllers/actors_controller.rb

SELECT "actors".* FROM "actors"
---
  def index
    @actors = Actor.all

INSERT INTO "actors" ("nombre", "nombre_real", "fecha_nacimiento", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nombre", "Teo"], ["nombre_real", "Abril"], ["fecha_nacimiento", "2019-04-04"], ["created_at", "2019-04-04 18:56:38.840986"], ["updated_at", "2019-04-04 18:56:38.840986"]]
---
  def create
    @actor = Actor.new(actor_params)

    respond_to do |format|
      if @actor.save

DELETE FROM "actors" WHERE "actors"."id" = ?  [["id", 4]]
---
  def destroy
    @actor.destroy

SELECT  "actors".* FROM "actors" WHERE "actors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_actor
      @actor = Actor.find(params[:id])