app/controllers/casetes_controller.rb

SELECT "casetes".* FROM "casetes"
---
  def index
    @casetes = Casete.all

INSERT INTO "casetes" ("formato", "pelicula_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["formato", "CD"], ["pelicula_id", 1], ["created_at", "2019-04-02 14:53:10.601157"], ["updated_at", "2019-04-02 14:53:10.601157"]]
---
  def create
    @casete = Casete.new(casete_params)

    respond_to do |format|
      if @casete.save

UPDATE "casetes" SET "formato" = ?, "updated_at" = ? WHERE "casetes"."id" = ?  [["formato", "Prueba34"], ["updated_at", "2019-04-05 02:25:18.900653"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @casete.update(casete_params)

DELETE FROM "casetes" WHERE "casetes"."id" = ?  [["id", 5]]
---
  def destroy
    @casete.destroy

SELECT  "casetes".* FROM "casetes" WHERE "casetes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_casete
      @casete = Casete.find(params[:id])