app/controllers/repartos_controller.rb

SELECT "repartos".* FROM "repartos"
---
  def index
    @repartos = Reparto.all

INSERT INTO "repartos" ("pelicula_id", "actor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["pelicula_id", 1], ["actor_id", 1], ["created_at", "2019-04-04 19:00:48.630850"], ["updated_at", "2019-04-04 19:00:48.630850"]]
---
  def create
    @reparto = Reparto.new(reparto_params)

    respond_to do |format|
      if @reparto.save

UPDATE "repartos" SET "actor_id" = ?, "updated_at" = ? WHERE "repartos"."id" = ?  [["actor_id", 3], ["updated_at", "2019-04-05 02:22:52.047332"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @reparto.update(reparto_params)

DELETE FROM "repartos" WHERE "repartos"."id" = ?  [["id", 3]]
---
  def destroy
    @reparto.destroy

SELECT  "repartos".* FROM "repartos" WHERE "repartos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_reparto
      @reparto = Reparto.find(params[:id])